In [1]:
import numpy as np
import pandas as pd

dataset=pd.read_csv('customer_data.csv')

In [2]:
dataset

     CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [3]:
x=dataset.iloc[:,[3,4]].values

In [4]:
from sklearn.cluster import DBSCAN
dbscan=DBSCAN(eps=3,min_samples=4) #initiating object from class

In [5]:
dbscan.fit(x)

DBSCAN(eps=3, min_samples=4)

In [6]:
labels=dbscan.labels_

In [7]:
labels

array([-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1,  0,  0,  0,  0, -1, -1,  0, -1,  0, -1,  0,  0,
       -1,  0, -1, -1,  0, -1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
        1,  1,  1, -1,  2,  1,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,
        2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  2,  3,  2,
        3,  3, -1,  3, -1, -1,  4, -1, -1, -1,  4,  5,  4, -1,  4,  5, -1,
        5,  4, -1,  4,  5, -1, -1,  6, -1, -1, -1,  7, -1,  6, -1,  6, -1,
        7, -1,  6, -1,  7, -1,  7, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
        8, -1,  8, -1,  8, -1,  8, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1,
       -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1], dtype=int64)

In [19]:
data=pd.DataFrame()

data['Annual Income (k$)']=dataset['Annual Income (k$)']
data['Spending Score (1-100)']=dataset['Spending Score (1-100)']
data['labels']=labels

In [20]:
data

     Annual Income (k$)  Spending Score (1-100)  labels
0                    15                      39      -1
1                    15                      81      -1
2                    16                       6      -1
3                    16                      77      -1
4                    17                      40      -1
..                  ...                     ...     ...
195                 120                      79      -1
196                 126                      28      -1
197                 126                      74      -1
198                 137                      18      -1
199                 137                      83      -1

[200 rows x 3 columns]